app/Controllers/StudentController.php

SELECT COUNT(*) AS `numrows` FROM `students`
---
        }


        $numRows = $db->table('students')->countAll();

DELETE FROM `students`
WHERE `id` = '67'
---
    public function action()
    {

        if ($this->request->getPost('action') == 'edit') {

            $student = new Student();
            $student->where('id', $this->request->getPost('id'))
                ->set([
                    'name' => $this->request->getPost('name'),
                    'subject' => $this->request->getPost('subject'),
                    'mark' => $this->request->getPost('mark')
                ])
                ->update();

            echo json_encode($this->request->getPost());
        }

        if ($this->request->getPost('action') == 'delete') {
            $student = new Student();
            $student->where('id', $this->request->getPost('id'))->delete();

SELECT *
FROM `students`
ORDER BY `id` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `students`
---
    public function normalTable()
    {
        $search = $this->request->getGet('search');
        $student = new Student();

        if(isset($search)){

            $data['students'] = $student->asObject()
            ->like('name', $search)
            ->orLike('subject', $search)
            ->orLike('mark', $search)
            ->orderBy('id', 'DESC')
            ->paginate(5);

        }else{

            $data['students'] = $student->asObject()
            ->orderBy('id', 'DESC')
            ->paginate(5);

UPDATE `students` SET `name` = 'Digil', `subject` = 'Biology', `mark` = '49'
WHERE `id` = '5'
---
    public function normalTableAction()
    {

        if ($this->request->isAJAX()) {

            if ($this->request->getPost('action') == 'edit') {

                $validate = [
                    'name' => [
                        'rules' => 'required|min_length[3]|max_length[100]',
                    ],
                    'subject' => [
                        'rules' => 'required|min_length[3]|max_length[100]',
                    ],
                    'marks' => [
                        'rules' => 'required|integer'
                    ]
                ];

                if (!$this->validate($validate)) {
                    return response()->setJSON([
                        'newToken' => csrf_hash(),
                        'errors' => $this->validator->getErrors()
                    ]);
                } else {

                    $student = new Student();
                    $student->where('id', $this->request->getPost('id'))
                        ->set([
                            'name' => $this->request->getPost('name'),
                            'subject' => $this->request->getPost('subject'),
                            'mark' => $this->request->getPost('marks')
                        ])
                        ->update();